public/intro-to-regex.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Intro To Regex</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" >
</head>
<body>
<div id="content" class="content">
<h1 class="title">Intro To Regex</h1>
<nav class="breadcrumbs">
<a href="/index.html">index</a> <span class="separator">/</span> <span>.</span>
</nav>
<div id="table-of-contents" role="doc-toc">
<div class="toc-header" onclick="toggleToc()">
<h2>Table of Contents</h2>
<div class="toggle-icon">+</div>
</div>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga4cb9c8">Regular expression concepts</a>
<ul>
<li><a href="#orgc54a9c7"><code>grep</code> options</a></li>
<li><a href="#org9580a93">Robustness</a></li>
</ul>
</li>
<li><a href="#orgd5368d3">Basic regex components</a>
<ul>
<li><a href="#org7c3122a">single char expressions</a></li>
<li><a href="#org4b52b66">bracket expressions</a></li>
<li><a href="#org7360e7a">repetition - zero or more</a></li>
<li><a href="#org8e87ee7">repetition - interval expressions</a></li>
<li><a href="#orgcc7fded">achoring maches</a></li>
<li><a href="#org6f9d2e2">parenthasized subexpressions</a></li>
<li><a href="#orgd280699">operator precedence</a></li>
<li><a href="#org0c833f6">longest, leftmost match</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga4cb9c8" class="outline-2">
<h2 id="orga4cb9c8">Regular expression concepts</h2>
<div class="outline-text-2" id="text-orga4cb9c8">
<p>
A regex is a language describing text to be matched
</p>

<p>
A regex is composed of:
</p>
<ul class="org-ul">
<li><b>regular chars</b> that stand for themselves</li>
<li><b>metachars</b> that stand for a regular expression</li>
<li><b>expressions</b> denoting categories of chars or sub-parts of a regex</li>
</ul>

<p>
Historically, different tools used different regex "flavors"
</p>

<p>
POSIX standardizes 2 flavours.
Other tools enhances regexs beyond what we cover here
</p>

<ul class="org-ul">
<li><b>Basic Regucal Expression (BRE)</b>
<ul class="org-ul">
<li>simpler to learn, less computationally expensive</li>
</ul></li>
<li><b>Extended Regucal Expression (*ERE)</b>
<ul class="org-ul">
<li>much more powerful, more expensive</li>
<li>on moern systems, no real difference in "expense"</li>
</ul></li>
</ul>

<p>
What programs use regex?
</p>
<ul class="org-ul">
<li>The <code>grep</code> family
<ul class="org-ul">
<li><code>grep</code> - BRE</li>
<li><code>egrep</code> and <code>grep -E</code> - ERE</li>
<li><code>fgrep</code> and <code>grep -F</code> - string matching in parallel</li>
<li>POSIX standardizing brings them all into the single <code>grep</code> command</li>
</ul></li>
<li><code>sed</code> - text matching and substitution</li>
<li><code>awk</code> - pattern matching with programming</li>
<li>text editors: <code>ed</code>, <code>ex</code>, <code>vim</code>, <code>emacs</code></li>
<li>scripting languages, usually with their on flavours</li>
</ul>
</div>
<div id="outline-container-orgc54a9c7" class="outline-3">
<h3 id="orgc54a9c7"><code>grep</code> options</h3>
<div class="outline-text-3" id="text-orgc54a9c7">
<ul class="org-ul">
<li>use <code>pat</code> as pattern: <code>-e pat</code></li>
<li>read list of patterns from file: <code>-f file</code></li>
<li>ignore case in input: <code>-i</code></li>
<li>list matching input files: <code>-l</code></li>
<li>print lines that don't match: <code>-v</code></li>
<li>supress output ("quiet", exit status only): <code>-q</code>
<ul class="org-ul">
<li>often, you can use <code>&gt; /dev/null</code> instead (more obvious)</li>
</ul></li>
<li>don't print errors ("silent"): <code>-s</code></li>
</ul>
</div>
</div>
<div id="outline-container-org9580a93" class="outline-3">
<h3 id="org9580a93">Robustness</h3>
<div class="outline-text-3" id="text-org9580a93">
<ul class="org-ul">
<li>invest time in learning regexs</li>
<li>use EREs wherever possible</li>
<li><b>always quote your regexs on the shell command line</b></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd5368d3" class="outline-2">
<h2 id="orgd5368d3">Basic regex components</h2>
<div class="outline-text-2" id="text-orgd5368d3">
</div>
<div id="outline-container-org7c3122a" class="outline-3">
<h3 id="org7c3122a">single char expressions</h3>
<div class="outline-text-3" id="text-org7c3122a">
<ul class="org-ul">
<li>reg chars, like "A" or "#" match themselves</li>
<li>case matters: "A" and "a" are different</li>
<li>period ("dot") matches any single char
<ul class="org-ul">
<li>may or may not match newline, program dependent</li>
</ul></li>
<li>escaped metachar:
<ul class="org-ul">
<li><code>\.</code> matches a real period</li>
<li><code>\\</code> matches a real backslash</li>
</ul></li>

<li>reg chars match themselves:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'Hi there how are you'</span> | grep --color <span style="font-style: italic;">'how'</span>
</pre>
</div>

<pre class="example">
Hi there how are you
</pre>


<ul class="org-ul">
<li>dot matches any single char:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> tolstoy says im toldtoy | grep --color tol.toy
</pre>
</div>

<pre class="example">
tolstoy says im toldtoy
</pre>
</div>
</div>
<div id="outline-container-org4b52b66" class="outline-3">
<h3 id="org4b52b66">bracket expressions</h3>
<div class="outline-text-3" id="text-org4b52b66">
<ul class="org-ul">
<li>any one of a set: <code>[aeiouy]</code> matches <i>one</i> Englis vowel</li>
<li>any not in a set: <code>[^aieouy]</code> matches a non-vowel</li>
<li>ranges: <code>[0-9]</code> -&gt; a digit, <code>[a-z]</code> -&gt; a lowercase letter
<ul class="org-ul">
<li>locale dependent (messy)</li>
</ul></li>
<li>characted classes: digits, punctuation, letters, &#x2026;
<ul class="org-ul">
<li>classes: alnum, alpha, blank, cntrl, digit, graph, lower, print, punct, space, upper, digit</li>
</ul></li>

<li><code>grep</code> matches all ocurrences</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | grep --color <span style="font-style: italic;">'[aeiouy]'</span>
</pre>
</div>

<pre class="example">
123 eafg
</pre>


<p>
Using <code>sed</code> to substitute, matches only the first:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | sed <span style="font-style: italic;">'s/[aeiouy]/X/'</span>
</pre>
</div>

<pre class="example">
123 Xafg
</pre>


<p>
Complemented bracket expressions &amp; char classes:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | grep --color <span style="font-style: italic;">'[^aeiouy]'</span>
<span style="font-weight: bold;">echo</span> 123 eafg | grep --color <span style="font-style: italic;">'[[:digit:]]'</span>
</pre>
</div>

<pre class="example">
123 eafg
123 eafg
</pre>
</div>
</div>
<div id="outline-container-org7360e7a" class="outline-3">
<h3 id="org7360e7a">repetition - zero or more</h3>
<div class="outline-text-3" id="text-org7360e7a">
<p>
Asterisk ("star") indicates zero or more of the preceding char
</p>

<ul class="org-ul">
<li><code>ab*c</code> matches <code>ac</code>, <code>abc</code>, <code>abbc</code>,  <code>abbbc</code>, &#x2026;</li>
<li>zero of "x" does not mean one or more of "y"</li>
<li><code>.*</code> matches any single char, 0 or more times (careful, <b>also matches null string</b>)</li>
</ul>
</div>
</div>
<div id="outline-container-org8e87ee7" class="outline-3">
<h3 id="org8e87ee7">repetition - interval expressions</h3>
<div class="outline-text-3" id="text-org8e87ee7">
<ul class="org-ul">
<li><code>c\{N\}</code> - <i>N</i> occurrences of <i>c</i></li>
<li><code>c\{N,\}</code> - at least <i>N</i> occurrences of <i>c</i></li>
<li><code>c\{N, M\}</code> - <i>N</i> to <i>M</i> occurrences of <i>c</i> (<i>N</i>, <i>M</i> up to <code>RE_DUP_MAX</code>)</li>
</ul>

<p>
Here <i>c</i> means a single char as described earlier
</p>
</div>
</div>
<div id="outline-container-orgcc7fded" class="outline-3">
<h3 id="orgcc7fded">achoring maches</h3>
<div class="outline-text-3" id="text-orgcc7fded">
<ul class="org-ul">
<li>cared ("up arrow", "hat", <code>^</code>) - match must start at beginning of line or string</li>
<li>dollar sign (<code>$</code>) - match must occur at end of line or string</li>
<li><code>^</code> and <code>$</code> in the middle of a BRE stand for themselves</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 you 123 | grep --color <span style="font-style: italic;">'^[[:digit:]]*'</span>

<span style="font-weight: bold;">echo</span> 123 you 123 | grep --color <span style="font-style: italic;">'^[^[:digit:]]*'</span>

<span style="font-weight: bold;">echo</span> 123 you 123 | grep --color <span style="font-style: italic;">'[^[:digit:]]*$'</span>
</pre>
</div>

<pre class="example">
123 you 123
123 you 123
</pre>
</div>
</div>
<div id="outline-container-org6f9d2e2" class="outline-3">
<h3 id="org6f9d2e2">parenthasized subexpressions</h3>
<div class="outline-text-3" id="text-org6f9d2e2">
<ul class="org-ul">
<li><code>\(a[bc\)\(123\)xx\2\1</code> - same as <code>a[bc]123xxM2M1</code>
<ul class="org-ul">
<li><i>M1</i> and <i>M2</i> are the actual text that matched the expressions in the parentheses</li>
<li>contents of parentheses can be any regex!</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> pre ab123xx123xab post | grep --color <span style="font-style: italic;">'\(a[bc]\)\([0-9][0-9]*\)xx\2x\1'</span>
<span style="font-weight: bold;">echo</span> pre ab123xx321xac post | grep --color <span style="font-style: italic;">'\(a[bc]\)\([0-9][0-9]*\)xx\2x\1'</span>
</pre>
</div>

<pre class="example">
pre ab123xx123xab post
</pre>


<ul class="org-ul">
<li>up to 9 parenthesized subexpres are allowed</li>

<li>often termed "backreferences"</li>

<li><b>BREs only</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgd280699" class="outline-3">
<h3 id="orgd280699">operator precedence</h3>
<div class="outline-text-3" id="text-orgd280699">
<p>
From heighest to lowest:
</p>
<ol class="org-ol">
<li>bracket symbols: <code>[:class:]</code>, <code>[=c=]</code>, <code>[.cs.]</code></li>
<li><code>\metachar</code></li>
<li>bracket expressions</li>
<li><code>\(...\)</code> and <code>\digit</code></li>
<li><code>*</code> and <code>\{...\}</code></li>
<li>concatenation (<code>abc</code> is a followed by <code>b</code> followed by <code>c</code>)</li>
<li><code>^</code> and <code>$</code> anchors</li>
</ol>
</div>
</div>
<div id="outline-container-org0c833f6" class="outline-3">
<h3 id="org0c833f6">longest, leftmost match</h3>
<div class="outline-text-3" id="text-org0c833f6">
<ul class="org-ul">
<li>regexs match the longest possible, leftmost ocurrence of text that can match</li>
<li>the match ends at the first character that cannot be matched</li>
<li>if some text matched, that text is used, even if a longer match occurs later on the line</li>
<li>this matters when doing substitutions (replacing matched text with <code>sed</code>, <code>awk</code>, &#x2026;)</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg 123 youyou | sed <span style="font-style: italic;">'s/[aeiouy]*/X/'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">g for matching ALL
</span><span style="font-weight: bold;">echo</span> 123 eafg 123 youyou | sed <span style="font-style: italic;">'s/[aeiouy][aeiouy]*/X/g'</span>
</pre>
</div>

<pre class="example">
X123 eafg 123 youyou
123 Xfg 123 X
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
